package practice_3.task4;

/**
 * Предположим, что мы ученые-орнитологи и хотим классифицировать птиц по разным признакам.
 *
 * Мы знаем, что некоторые птицы умеют плавать, а некоторые птицы умеют летать.
 * При этом и летающие и водоплавающие имеют возможность издавать звук, но каждая свой отдельный
 *
 * Написать код, реализующий такое поведение с помощью интерфейсов, асбтрактных классов.
 * Реализовать метод (подумайте сами где, возвращающий значение типа птицы, если он вызывается у разных видов птиц)
 * Подумать, зачем тут абстрактный класс и зачем тут интерфейс?
 */
public class Main {
    public static void main(String[] args) {

        Bird sparrow = new Sparrow("sparrow",BirdType.FLY);
        Bird donald = new Duck("duck",BirdType.BOTH);

        System.out.println(sparrow.toString());
        System.out.println(donald.toString());
    }
}
